src_ext/Documents/УЗ_РасчетЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_РасчетЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасходДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перемещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПеремещениеДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УЗ_НачисленияПедагогам</v8:Type>
								<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_РасчетыПоЗарплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_РасчетыПоЗарплате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НеИзменять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_Касса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_Касса</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаУченики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Documents/УЗ_ПеремещениеДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПеремещениеДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбученияОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделатьДвиженияПоВзаиморасчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбученияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_РасходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_РасходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_РасчетЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)	
	
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
	
	Объект.ДД.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	Объект.ДД.Очистить();
	ЗаполнитьТЧНаСервере();
КонецПроцедуры

Процедура ЗаполнитьТЧНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УЗ_РасчетыПоЗарплатеОстаткиИОбороты.Регистратор КАК Регистратор,
		|	УЗ_РасчетыПоЗарплатеОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
		|	УЗ_РасчетыПоЗарплатеОстаткиИОбороты.НеИзменять КАК НеИзменять,
		|	УЗ_РасчетыПоЗарплатеОстаткиИОбороты.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрНакопления.УЗ_РасчетыПоЗарплате.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, , ) КАК УЗ_РасчетыПоЗарплатеОстаткиИОбороты
		|ГДЕ
		|	УЗ_РасчетыПоЗарплатеОстаткиИОбороты.Организация = &Организация
		|	И УЗ_РасчетыПоЗарплатеОстаткиИОбороты.Педагог = &Педагог";	
	Запрос.УстановитьПараметр("Педагог", Объект.Педагог);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ДатаНачала));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ДатаОкончания));
	РезультатЗапроса = Запрос.Выполнить();	
	Док = РезультатЗапроса.Выбрать();
	
	Пока Док.Следующий() Цикл		
		
		СтрокаТЧ = Объект.ДД.Добавить();
		
		СтрокаТЧ.Комментарий= Док.Комментарий;
		СтрокаТЧ.Документ 	= Док.Регистратор;
		СтрокаТЧ.Начисление = Док.СуммаПриход;
		//СтрокаТЧ.НеИзменять = Док.НеИзменять;
		СтрокаТЧ.КОплате 	= Док.СуммаПриход;
		
	КонецЦикла;
	
	Объект.СуммаДокумента 	= Объект.ДД.Итог("КОплате");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Период.ДатаНачала = Объект.ДатаНачала;
	Период.ДатаОкончания = Объект.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ПедагогПриИзменении(Элемент) 	
	Объект.ДД.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ДДПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ДД.Итог("КОплате");
КонецПроцедуры

Функция КассаПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассаОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.УЗ_Касса.Остатки(, ) КАК КассаОстатки
		|ГДЕ
		|	КассаОстатки.Касса = &Касса";  	
	Запрос.УстановитьПараметр("Касса", Объект.Касса);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьОстатокПоКассе(Команда)
	ОстатокВКассе = КассаПриИзмененииНаСервере();	
КонецПроцедуры

Функция ПереместитьДеньгиНаСервере()
	
	НовПеремещение = Документы.УЗ_ПеремещениеДенег.СоздатьДокумент();
	НовПеремещение.ВидОперации 			= Перечисления.УЗ_ВидыОпераций.ВнутренняяКасса;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НовПеремещение.ДокументОснования 	= Объект.Ссылка;
	КонецЕсли;

	НовПеремещение.АвторДокумента 		= УЗ_Среда.ТекущийПользователь();
	НовПеремещение.КассаОтправитель		= Объект.Касса;
	НовПеремещение.КассаПолучатель		= Справочники.УЗ_Кассы.ПолучитьОсновнуюКассу();
	НовПеремещение.Клиент 				= Объект.Педагог;
	НовПеремещение.Сумма 				= КассаПриИзмененииНаСервере();
	НовПеремещение.Дата					= Объект.ДатаОкончания-1;
	НовПеремещение.Организация 			= Объект.Организация;
	
	Попытка
		НовПеремещение.Записать(РежимЗаписиДокумента.Проведение);
		Возврат НовПеремещение.Ссылка;
	Исключение
		Сообщить("Не удалось провести Перемещение!"+ " " +ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Документы.УЗ_ПеремещениеДенег.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура ПереместитьДеньги(Команда)
	               	
	Если ЗначениеЗаполнено(Объект.Перемещение) Тогда
		Сообщить("Невозможно создать еще одно Перемещение! Существует уже созданное ранее.");
		Возврат;
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(Объект.СуммаДокумента) и ЗначениеЗаполнено(Объект.Касса) и ЗначениеЗаполнено(Объект.Педагог) и ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.Перемещение = ПереместитьДеньгиНаСервере();
		//ОткрытьЗначение(Объект.Перемещение);
	Иначе
		Сообщить("Невозможно создать Перемещение! Возможно незаполнены поля: Касса, Педагог, СуммаДокумента, Период");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ДД.Итог("Начисления");
КонецПроцедуры

Функция СделтьРКОНаСервере()
	
	НовРКО = Документы.УЗ_РасходДенег.СоздатьДокумент();
	НовРКО.ВидОперации 			= Перечисления.УЗ_ВидыОпераций.ВнутренняяКасса;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НовРКО.ДокументОснования 	= Объект.Ссылка;
	КонецЕсли;
	НовРКО.АвторДокумента 		= УЗ_Среда.ТекущийПользователь();
	НовРКО.Касса 				= Объект.Касса;
	НовРКО.ФизЛицо 			= Объект.Педагог;
	НовРКО.Организация 			= Объект.Организация;
	НовРКО.СуммаДокумента 		= Объект.СуммаДокумента;
	НовРКО.Дата					= Объект.ДатаОкончания-1;
	
	Попытка
		НовРКО.Записать(РежимЗаписиДокумента.Проведение);		
		Возврат НовРКО.Ссылка;
	Исключение
		Сообщить("Не удалось провести РКО!"+ " " +ОписаниеОшибки());
	КонецПопытки;

	Возврат Документы.УЗ_РасходДенег.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура СделтьРКО(Команда)

	Оповещение = Новый ОписаниеОповещения("СделтьРКОЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Создать расходный кассовый ордер на выплату зарплаты?", РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры

&НаКлиенте
Процедура СделтьРКОЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РКО) Тогда
		Сообщить("Невозможно создать еще один Расходный ордер! Существует уже созданный ранее.");
		Возврат;
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(Объект.СуммаДокумента) и ЗначениеЗаполнено(Объект.Касса) и ЗначениеЗаполнено(Объект.Педагог) и ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.РКО = СделтьРКОНаСервере();
		Если ЗначениеЗаполнено(Объект.РКО) Тогда
			Записать();
		КонецЕсли;
		//ОткрытьЗначение(Объект.РКО);
		ПроверитьРКО()
	Иначе
		Сообщить("РКО невозможно создать! Не заполнены обязательные поля: Касса, Педагог, СуммаДокумента, Период");
	КонецЕсли; 

КонецПроцедуры

Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//TODO УЗ: даты запрета
//	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	ПроверитьРКО();
КонецПроцедуры

Процедура ПроверитьРКО()
	Если Объект.Проведен Тогда
		Если ЗначениеЗаполнено(Объект.РКО) и Объект.РКО.Проведен Тогда
			Элементы.ДекорацияВыплачено.Видимость = Истина;
			Элементы.ДекорацияВыплачено.ЦветТекста = WebЦвета.Зеленый;
			Элементы.ДекорацияВыплачено.Заголовок = "ВЫПЛАЧЕНО ПОЛНОСТЬЮ!";
			Элементы.РКО.ЦветФона = WebЦвета.СветлоЗеленый;
			Если Объект.СуммаДокумента > Объект.РКО.СуммаДокумента Тогда
				Элементы.ДекорацияВыплачено.Заголовок = "ВЫПЛАЧЕН НЕ ПОЛНОСТЬЮ!";
				Элементы.ДекорацияВыплачено.ЦветТекста = WebЦвета.Оранжевый;
				Элементы.РКО.ЦветФона = WebЦвета.Оранжевый;
			ИначеЕсли Объект.СуммаДокумента < Объект.РКО.СуммаДокумента Тогда
				Элементы.ДекорацияВыплачено.Заголовок = "ПЕРЕПЛАЧЕНО!";
				Элементы.ДекорацияВыплачено.ЦветТекста = WebЦвета.Фиолетовый;
				Элементы.РКО.ЦветФона = WebЦвета.Фиолетовый;
			КонецЕсли;			
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.РКО) Тогда
			Элементы.ДекорацияВыплачено.Видимость = Истина;
			Элементы.ДекорацияВыплачено.Заголовок = "НЕ ВЫПЛАЧЕНО!";
			Элементы.ДекорацияВыплачено.ЦветТекста = WebЦвета.Оранжевый;
			Элементы.РКО.ЦветФона = Новый Цвет();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПроверитьРКО();
КонецПроцедуры 

&НаКлиенте
Процедура РКОПриИзменении(Элемент)
	ПроверитьРКО();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";	
	Если Запрос.Выполнить().Выгрузить().Количество() = 0 Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли; 

КонецПроцедуры
